{
    "systems": [
        {
            "name": "Website",
            "status": "operational",
            "message": "The website is functioning normally with no reported issues."
        },
        {
            "name": "API Service",
            "status": "operational",
            "message": "All API endpoints are responding normally."
        },
        {
            "name": "Database",
            "status": "operational",
            "message": "Database queries are performing as expected."
        },
        {
            "name": "CDN",
            "status": "operational",
            "message": "Content delivery network is functioning optimally."
        }
    ],
    "incidents": [
        {
            "id": "inc-20251020-001",
            "title": "Degraded Performance Across HEAT Labs (AWS Outage)",
            "description": "HEAT Labs is currently experiencing degraded performance across multiple services due to a major AWS outage affecting parts of our infrastructure. Users may encounter long loading times, missing or partially loaded content, and intermittent outages on both the main site and subdomains. The status page may also be impacted.",
            "severity": "warning",
            "start_time": "2025-10-20T17:00:00Z",
            "status": "started",
            "updates": [
                {
                    "status": "identified",
                    "message": "We are currently experiencing degraded performance across several HEAT Labs services due to a major AWS outage. Users may see long loading times, missing content, or temporary outages.",
                    "time": "2025-10-20T17:00:00Z"
                },
                {
                    "status": "monitoring",
                    "message": "We are monitoring the ongoing AWS outage and will restore full functionality as soon as AWS services return to normal.",
                    "time": "2025-10-20T17:30:00Z"
                }
            ]
        },
        {
            "id": "inc-20250819-001",
            "title": "World of Tanks: HEAT Rebranding",
            "description": "The rebranding process has been successfully completed! The game now has its official name, and our site along with all pages are back online. We appreciate your patience and support during this transition.",
            "severity": "warning",
            "start_time": "2025-08-19T21:05:18Z",
            "end_time": "2025-08-20T08:01:11Z",
            "status": "ended",
            "updates": [
                {
                    "status": "started",
                    "message": "Rebranding in progress. Website will be unavailable during this time.",
                    "time": "2025-08-19T21:05:18Z"
                },
                {
                    "status": "maintenance",
                    "message": "Rebranding process is at approximately 80% as we approach the final checks and tests to all systems, all pages will remain unavailable.",
                    "time": "2025-08-20T05:08:45Z"
                },
                {
                    "status": "maintenance",
                    "message": "Rebranding process is now complete, all pages should be available now as we do our final checks.",
                    "time": "2025-08-20T06:09:44Z"
                },
                {
                    "status": "ended",
                    "message": "All final checks have been completed and the rebranding process is now finished.",
                    "time": "2025-08-20T08:01:11Z"
                }
            ]
        },
        {
            "id": "inc-20250609-001",
            "title": "Migration of Website Statistics, Changelog and Status Pages",
            "description": "This migration moved the Website Statistics, Changelog, and Status Pages into standalone repositories, separating them from the main website repository. The goal is to enable hosting these pages on dedicated subdomains in the future, allowing them to operate independently from the main website.",
            "severity": "warning",
            "start_time": "2025-06-08T20:04:29Z",
            "end_time": "2025-06-08T21:10:32Z",
            "status": "ended",
            "updates": [
                {
                    "status": "ended",
                    "message": "Migration completed successfully. Website Statistics, Changelog, and Status Pages are now fully operational on the new system.",
                    "time": "2025-06-08T21:10:32Z"
                },
                {
                    "status": "maintenance",
                    "message": "Final checks and data verification are in progress. Services may appear temporarily unavailable or out of sync.",
                    "time": "2025-06-08T20:45:12Z"
                },
                {
                    "status": "started",
                    "message": "Migration in progress. Website Statistics, Changelog, and Status Pages may be partially unavailable during this time.",
                    "time": "2025-06-08T20:04:29Z"
                }
            ]
        },
        {
            "id": "inc-20250606-001",
            "title": "Site-wide Image Optimizations",
            "description": "We are in the process of migrating all website images from .png to the more efficient .webp format to improve loading speeds. During this transition, you may experience temporary display issues until the updates fully propagate across all CDN nodes.",
            "severity": "warning",
            "start_time": "2025-06-06T10:06:09Z",
            "end_time": "2025-06-06T11:32:15Z",
            "status": "ended",
            "updates": [
                {
                    "status": "ended",
                    "message": "Image optimization has been successfully completed. All systems are fully operational and image loading functionality has returned to normal.",
                    "time": "2025-06-06T11:32:15Z"
                },
                {
                    "status": "maintenance",
                    "message": "Image optimization has been completed. We are currently verifying that all images are displaying correctly and no functionality is affected.",
                    "time": "2025-06-06T11:19:31Z"
                },
                {
                    "status": "started",
                    "message": "Image optimization maintenance has started. Some visual elements may load improperly while CDN updates are in progress.",
                    "time": "2025-06-06T10:06:09Z"
                }
            ]
        }
    ]
}